In [1]:
import pandas as pd
import numpy as np

In [2]:
fn_out = '../output/wikipedia_metrics.csv'

In [3]:
fn = '../input/wikipedia_edits.csv'

In [4]:
df = pd.read_csv(fn)

In [8]:
df_edits = pd.DataFrame(df.groupby('title').size())

In [9]:
df_edits

                     0
title
50_Cent          13066
Adele             6725
Angelina_Jolie    7336
Backstreet_Boys  10270
Ben_Affleck       9263
...                ...
The_Weeknd        7432
Tiger_Woods       9026
Tom_Cruise        7769
Tom_Hanks         7846
U2               14360

[82 rows x 1 columns]

In [10]:
df_edits.columns = ['edits']

In [11]:
df_edits.head()

                 edits
title
50_Cent          13066
Adele             6725
Angelina_Jolie    7336
Backstreet_Boys  10270
Ben_Affleck       9263

In [12]:
df_size = pd.DataFrame(df.groupby('title')['size'].sum())

In [16]:
df.groupby('title')['size'].sum()

title
50_Cent             518204129
Adele               456912673
Angelina_Jolie      531496219
Backstreet_Boys     412497115
Ben_Affleck         906521569
                      ...
The_Weeknd          302984214
Tiger_Woods         795662553
Tom_Cruise          317297362
Tom_Hanks           304566393
U2                 1040351902
Name: size, Length: 82, dtype: int64

In [17]:
type(_)

pandas.core.series.Series

In [23]:
df.groupby('title')['size'].agg([len, np.sum, np.mean, np.median, np.std]).head(5)

                   len        sum          mean   median           std
title
50_Cent          13066  518204129  39660.502755  31501.5  26777.379558
Adele             6725  456912673  67942.404907  74780.0  36977.716573
Angelina_Jolie    7336  531496219  72450.411532  73595.0  38691.884308
Backstreet_Boys  10270  412497115  40165.249757  29718.0  27890.022184
Ben_Affleck       9263  906521569  97864.792076  65546.0  71112.542633

In [24]:
type(_)

pandas.core.frame.DataFrame

In [21]:
df.groupby('title')['size'].agg(np.sum)

title
50_Cent             518204129
Adele               456912673
Angelina_Jolie      531496219
Backstreet_Boys     412497115
Ben_Affleck         906521569
                      ...
The_Weeknd          302984214
Tiger_Woods         795662553
Tom_Cruise          317297362
Tom_Hanks           304566393
U2                 1040351902
Name: size, Length: 82, dtype: int64

In [22]:
type(_)

pandas.core.series.Series

In [25]:
df_size

                       size
title
50_Cent           518204129
Adele             456912673
Angelina_Jolie    531496219
Backstreet_Boys   412497115
Ben_Affleck       906521569
...                     ...
The_Weeknd        302984214
Tiger_Woods       795662553
Tom_Cruise        317297362
Tom_Hanks         304566393
U2               1040351902

[82 rows x 1 columns]

In [26]:
df_users = df.groupby('title')['user'].nunique()

In [27]:
type(_)

pandas.core.frame.DataFrame

In [29]:
df_users

title
50_Cent            4557
Adele              2672
Angelina_Jolie     2902
Backstreet_Boys    4050
Ben_Affleck        3655
                   ...
The_Weeknd         3400
Tiger_Woods        3117
Tom_Cruise         3604
Tom_Hanks          3935
U2                 5305
Name: user, Length: 82, dtype: int64

In [30]:
type(_)

pandas.core.series.Series

In [31]:
df_users = pd.DataFrame(df_users)

In [33]:
df_users

                 user
title
50_Cent          4557
Adele            2672
Angelina_Jolie   2902
Backstreet_Boys  4050
Ben_Affleck      3655
...               ...
The_Weeknd       3400
Tiger_Woods      3117
Tom_Cruise       3604
Tom_Hanks        3935
U2               5305

[82 rows x 1 columns]

In [34]:
df_out = pd.merge(df_edits, df_size)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [35]:
df_size

                       size
title
50_Cent           518204129
Adele             456912673
Angelina_Jolie    531496219
Backstreet_Boys   412497115
Ben_Affleck       906521569
...                     ...
The_Weeknd        302984214
Tiger_Woods       795662553
Tom_Cruise        317297362
Tom_Hanks         304566393
U2               1040351902

[82 rows x 1 columns]

In [36]:
df_edits

                 edits
title
50_Cent          13066
Adele             6725
Angelina_Jolie    7336
Backstreet_Boys  10270
Ben_Affleck       9263
...                ...
The_Weeknd        7432
Tiger_Woods       9026
Tom_Cruise        7769
Tom_Hanks         7846
U2               14360

[82 rows x 1 columns]

In [38]:
type(df_edits)

pandas.core.frame.DataFrame

In [39]:
type(df_size)

pandas.core.frame.DataFrame

In [41]:
# df_out = pd.merge(df_edits, df_size)

In [42]:
df_edits.reset_index(inplace=True)

In [43]:
df_size.reset_index(inplace=True)

In [44]:
df_users.reset_index(inplace=True)

In [45]:
df_out = pd.merge(df_edits, df_size)

In [46]:
df_out = pd.merge(df_out, df_users)

In [47]:
df_out.head()

             title  edits       size  user
0          50_Cent  13066  518204129  4557
1            Adele   6725  456912673  2672
2   Angelina_Jolie   7336  531496219  2902
3  Backstreet_Boys  10270  412497115  4050
4      Ben_Affleck   9263  906521569  3655

In [48]:
df_out.to_csv(fn_out, index=False)